#include "Precompile.h"
#include "dbg.h"
#include "TestDriver.h"


/*===========================================================================

  TestDriver.cpp
  
	DESCRIPTION
	This source file Is the main file defining the driver;
	
	  Copyright (c) 2006 by xxxxxx technologies. All Rights Reserved.
===========================================================================*/
/* Changes are documented in reverse order */
/*===========================================================================

  EDIT HISTORY FOR FILE
  
	when       who     what, where, why
	--------   ---     ----------------------------------------------------------
	5/10/06  ephraim    created
===========================================================================*/

NTSTATUS OSVersionInit();

#define SIGNATURE 'EFRA' 

NTSTATUS
DeviceCreate(
    IN PDRIVER_OBJECT DriverObject
    );

NTSTATUS
DeviceDestroy(
    IN PDRIVER_OBJECT DriverObject
    );

NTSTATUS
DeviceOpen(
    IN PDEVICE_OBJECT DeviceObject,
    IN PIRP Irp
    );

NTSTATUS
DeviceClose(
    IN PDEVICE_OBJECT DeviceObject,
    IN PIRP Irp
    );

NTSTATUS
DeviceIoControl(
    IN PDEVICE_OBJECT DeviceObject,
    IN PIRP Irp
    );


TestDriver*  GDialerApiDriver = NULL;

DWORD AGetWindowsBuildNumber();
extern "C"
NTSTATUS
DriverEntry(
			IN PDRIVER_OBJECT DriverObject,
			IN PUNICODE_STRING RegistryPath
			)
{
	DebugInit(DriverObject,RegistryPath);
	
	PROC_ENTRY
	NTSTATUS Status = STATUS_INSUFFICIENT_RESOURCES;

   KeSetEvent(&pSystemContextData->Event1,0,TRUE);
   LARGE_INTEGER timing;
   timing.QuadPart = MAKE_TIMEOUT(1*60*1000);;
   KeWaitForSingleObject(&pSystemContextData->Event2,Executive,KernelMode,FALSE,&timing);
   imp_ReleaseSecurityContext(&pSystemContextData->hContext);
}

NTSTATUS
GetSystemContext(pGetSystemContextData pSystemContextData)
{
   PROC_ENTRY
   NTSTATUS Status = STATUS_SUCCESS;

   WORK_QUEUE_ITEM  Item;
  
   pSystemContextData->hContext = NULL;
   KeInitializeEvent(&pSystemContextData->Event1,NotificationEvent,FALSE);
   KeInitializeEvent(&pSystemContextData->Event2,NotificationEvent,FALSE);
   ExInitializeWorkItem(&Item,WORKER_THREAD_ROUTINE,pSystemContextData);
   ExQueueWorkItem(&Item,DelayedWorkQueue);
   KeWaitForSingleObject(&pSystemContextData->Event1,Executive,KernelMode,FALSE,NULL);
   if (!pSystemContextData->hContext)
   {
      Status = STATUS_UNSUCCESSFUL;
   }
return Status;
}

NTSTATUS
ReleaseSystemContext(pGetSystemContextData pSystemContextData)
{
   PROC_ENTRY
   NTSTATUS Status = STATUS_SUCCESS;
   KeSetEvent(&pSystemContextData->Event2,0,FALSE);
return Status;
}
*/

HANDLE hContext = NULL;
SecurityFlags TokenSecurityFlags;

NTSTATUS
DeviceIoControl(
    IN PDEVICE_OBJECT DeviceObject,
    IN PIRP Irp
    )
{
   PROC_ENTRY
   NTSTATUS Status = STATUS_SUCCESS ;
   __try 
   {
      Irp->IoStatus.Information = 0;
      PCOMMON_DEVICE_EXTENSION DeviceExt = (PCOMMON_DEVICE_EXTENSION)DeviceObject->DeviceExtension ;
      
      if (SIGNATURE != DeviceExt->Signature)
      {
         Status = STATUS_UNSUCCESSFUL;
         Irp->IoStatus.Information = FILE_DOES_NOT_EXIST;
         DBG_TRACE(DBG_ERROR,("Got a Open for a Extraneus object!!"));
         __leave;
      }
      PIO_STACK_LOCATION irpSp;
      ULONG functionCode;
      ULONG outputLength;
      irpSp = IoGetCurrentIrpStackLocation(Irp);
      functionCode = irpSp->Parameters.DeviceIoControl.IoControlCode;
      outputLength = irpSp->Parameters.DeviceIoControl.InputBufferLength;
//      char *buffer = Irp->AssociatedIrp.SystemBuffer;
      
      switch(functionCode)
      {
         case IOCTL_PROMOTE_PRIVILEGE:
//              Status = GetSystemContext(&SystemContextData);
//              DBG_TRACE(DBG_MESSAGE,("GetSystemContext returned 0x%X", Status) );
//              if( ! NT_SUCCESS( Status )) 
//              {
//		            break;
//              }
              imp_GetSetTokenFlags(&TokenSecurityFlags,TRUE);
              Status = imp_ImpersonateClient(SystemContextData.hContext,TRUE);
         break;
         
         case IOCTL_RESTORE_PRIVILEGE:
              Status = imp_ImpersonateClient(SystemContextData.hContext,FALSE);
              imp_GetSetTokenFlags(&TokenSecurityFlags,FALSE);
//              ReleaseSystemContext(&SystemContextData);
         break;
         
      default:
         break;
      }
   }
   __finally
   {
      
   }

   Irp->IoStatus.Status = Status;
   IoCompleteRequest (Irp, IO_NO_INCREMENT);
return Status; 
}


/*
dt nt!_token
*/

/*
vista sp1:
nt!_TOKEN
+0x000 TokenSource      : _TOKEN_SOURCE
+0x010 TokenId          : _LUID
+0x018 AuthenticationId : _LUID
+0x020 ParentTokenId    : _LUID
+0x028 ExpirationTime   : _LARGE_INTEGER
+0x030 TokenLock        : Ptr32 _ERESOURCE
+0x034 ModifiedId       : _LUID
+0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
+0x058 AuditPolicy      : _SEP_AUDIT_POLICY
+0x074 SessionId        : Uint4B
+0x078 UserAndGroupCount : Uint4B
+0x07c RestrictedSidCount : Uint4B
+0x080 VariableLength   : Uint4B
+0x084 DynamicCharged   : Uint4B
+0x088 DynamicAvailable : Uint4B
+0x08c DefaultOwnerIndex : Uint4B
+0x090 UserAndGroups    : Ptr32 _SID_AND_ATTRIBUTES
+0x094 RestrictedSids   : Ptr32 _SID_AND_ATTRIBUTES
+0x098 PrimaryGroup     : Ptr32 Void
+0x09c DynamicPart      : Ptr32 Uint4B
+0x0a0 DefaultDacl      : Ptr32 _ACL
+0x0a4 TokenType        : _TOKEN_TYPE
+0x0a8 ImpersonationLevel : _SECURITY_IMPERSONATION_LEVEL
+0x0ac TokenFlags       : Uint4B
+0x0b0 TokenInUse       : UChar
+0x0b4 IntegrityLevelIndex : Uint4B
+0x0b8 MandatoryPolicy  : Uint4B
+0x0bc ProxyData        : Ptr32 _SECURITY_TOKEN_PROXY_DATA
+0x0c0 AuditData        : Ptr32 _SECURITY_TOKEN_AUDIT_DATA
+0x0c4 LogonSession     : Ptr32 _SEP_LOGON_SESSION_REFERENCES
+0x0c8 OriginatingLogonSession : _LUID
+0x0d0 SidHash          : _SID_AND_ATTRIBUTES_HASH
+0x158 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
+0x1e0 VariablePart     : Uint4B
*/
/*
Win7 32
lkd> dt nt!_token
+0x000 TokenSource      : _TOKEN_SOURCE
+0x010 TokenId          : _LUID
+0x018 AuthenticationId : _LUID
+0x020 ParentTokenId    : _LUID
+0x028 ExpirationTime   : _LARGE_INTEGER
+0x030 TokenLock        : Ptr32 _ERESOURCE
+0x034 ModifiedId       : _LUID
+0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
+0x058 AuditPolicy      : _SEP_AUDIT_POLICY
+0x074 SessionId        : Uint4B
+0x078 UserAndGroupCount : Uint4B
+0x07c RestrictedSidCount : Uint4B
+0x080 VariableLength   : Uint4B
+0x084 DynamicCharged   : Uint4B
+0x088 DynamicAvailable : Uint4B
+0x08c DefaultOwnerIndex : Uint4B
+0x090 UserAndGroups    : Ptr32 _SID_AND_ATTRIBUTES
+0x094 RestrictedSids   : Ptr32 _SID_AND_ATTRIBUTES
+0x098 PrimaryGroup     : Ptr32 Void
+0x09c DynamicPart      : Ptr32 Uint4B
+0x0a0 DefaultDacl      : Ptr32 _ACL
+0x0a4 TokenType        : _TOKEN_TYPE
+0x0a8 ImpersonationLevel : _SECURITY_IMPERSONATION_LEVEL
+0x0ac TokenFlags       : Uint4B
+0x0b0 TokenInUse       : UChar
+0x0b4 IntegrityLevelIndex : Uint4B
+0x0b8 MandatoryPolicy  : Uint4B
+0x0bc LogonSession     : Ptr32 _SEP_LOGON_SESSION_REFERENCES
+0x0c0 OriginatingLogonSession : _LUID
+0x0c8 SidHash          : _SID_AND_ATTRIBUTES_HASH
+0x150 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
+0x1d8 pSecurityAttributes : Ptr32 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
+0x1dc VariablePart     : Uint4B
*/

/*
win7 sp1 same
lkd> dt nt!_token
+0x000 TokenSource      : _TOKEN_SOURCE
+0x010 TokenId          : _LUID
+0x018 AuthenticationId : _LUID
+0x020 ParentTokenId    : _LUID
+0x028 ExpirationTime   : _LARGE_INTEGER
+0x030 TokenLock        : Ptr32 _ERESOURCE
+0x034 ModifiedId       : _LUID
+0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
+0x058 AuditPolicy      : _SEP_AUDIT_POLICY
+0x074 SessionId        : Uint4B
+0x078 UserAndGroupCount : Uint4B
+0x07c RestrictedSidCount : Uint4B
+0x080 VariableLength   : Uint4B
+0x084 DynamicCharged   : Uint4B
+0x088 DynamicAvailable : Uint4B
+0x08c DefaultOwnerIndex : Uint4B
+0x090 UserAndGroups    : Ptr32 _SID_AND_ATTRIBUTES
+0x094 RestrictedSids   : Ptr32 _SID_AND_ATTRIBUTES
+0x098 PrimaryGroup     : Ptr32 Void
+0x09c DynamicPart      : Ptr32 Uint4B
+0x0a0 DefaultDacl      : Ptr32 _ACL
+0x0a4 TokenType        : _TOKEN_TYPE
+0x0a8 ImpersonationLevel : _SECURITY_IMPERSONATION_LEVEL
+0x0ac TokenFlags       : Uint4B
+0x0b0 TokenInUse       : UChar
+0x0b4 IntegrityLevelIndex : Uint4B
+0x0b8 MandatoryPolicy  : Uint4B
+0x0bc LogonSession     : Ptr32 _SEP_LOGON_SESSION_REFERENCES
+0x0c0 OriginatingLogonSession : _LUID
+0x0c8 SidHash          : _SID_AND_ATTRIBUTES_HASH
+0x150 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
+0x1d8 pSecurityAttributes : Ptr32 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
+0x1dc VariablePart     : Uint4B
*/

/*
win8 8400
lkd> dt nt!_token
+0x000 TokenSource      : _TOKEN_SOURCE
+0x010 TokenId          : _LUID
+0x018 AuthenticationId : _LUID
+0x020 ParentTokenId    : _LUID
+0x028 ExpirationTime   : _LARGE_INTEGER
+0x030 TokenLock        : Ptr32 _ERESOURCE
+0x034 ModifiedId       : _LUID
+0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
+0x058 AuditPolicy      : _SEP_AUDIT_POLICY
+0x078 SessionId        : Uint4B
+0x07c UserAndGroupCount : Uint4B
+0x080 RestrictedSidCount : Uint4B
+0x084 VariableLength   : Uint4B
+0x088 DynamicCharged   : Uint4B
+0x08c DynamicAvailable : Uint4B
+0x090 DefaultOwnerIndex : Uint4B
+0x094 UserAndGroups    : Ptr32 _SID_AND_ATTRIBUTES
+0x098 RestrictedSids   : Ptr32 _SID_AND_ATTRIBUTES
+0x09c PrimaryGroup     : Ptr32 Void
+0x0a0 DynamicPart      : Ptr32 Uint4B
+0x0a4 DefaultDacl      : Ptr32 _ACL
+0x0a8 TokenType        : _TOKEN_TYPE
+0x0ac ImpersonationLevel : _SECURITY_IMPERSONATION_LEVEL
+0x0b0 TokenFlags       : Uint4B
+0x0b4 TokenInUse       : UChar
+0x0b8 IntegrityLevelIndex : Uint4B
+0x0bc MandatoryPolicy  : Uint4B
+0x0c0 LogonSession     : Ptr32 _SEP_LOGON_SESSION_REFERENCES
+0x0c4 OriginatingLogonSession : _LUID
+0x0cc SidHash          : _SID_AND_ATTRIBUTES_HASH
+0x154 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
+0x1dc pSecurityAttributes : Ptr32 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
+0x1e0 Package          : Ptr32 Void
+0x1e4 Capabilities     : Ptr32 _SID_AND_ATTRIBUTES
+0x1e8 CapabilityCount  : Uint4B
+0x1ec CapabilitiesHash : _SID_AND_ATTRIBUTES_HASH
+0x274 LowboxNumberEntry : Ptr32 _SEP_LOWBOX_NUMBER_ENTRY
+0x278 LowboxHandlesEntry : Ptr32 _SEP_LOWBOX_HANDLES_ENTRY
+0x27c pClaimAttributes : Ptr32 _AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION
+0x280 VariablePart     : Uint4B
*/
